{
    "alarms": [
        {
            "name": "HOMESTEAD_PROCESS_FAIL",
            "index": 1500,
            "cause": "SOFTWARE_ERROR",
            "levels": [
                {
                  "severity": "CLEARED",
                  "details": "The local Homestead process has been restored to normal operation.",
                  "description": "Homestead: Process failure cleared.",
                  "cause": "The local Homestead process has been restored to normal operation. The previously issued alarm has been cleared.",
                  "effect": "The Homestead process is functioning normally again.",
                  "action": "No action."
                },
                {
                  "severity": "CRITICAL",
                  "details": "Monit has detected that the local Homestead process has failed. A restart will automatically be attempted. If this alarm does not clear, the Homestead process may have been stopped or an unrecoverable failure may have occurred.",
                  "description": "Homestead: Process failure.",
                  "cause": "The system has detected that the Homestead process has failed.",
                  "effect": "In progress requests will fail and Sprout may be required to retransmit requests to a different Homestead instance. If only a small percentage of Homestead processes are failed simultaneously then in a typical deployment there will be no significant impact. However multiple simultaneous failures will result in an increasingly significant reduction in HSS communication capacity and will eventually result in service impacts. If all Homestead processes are failed then all registrations and all new calls involving local subscribers will fail.",
                  "action": "Monitor for the alarm to clear and confirm the system is operating normally. If the failed Homestead process fails to return to service then contact your support representative."
                }
            ]
        },
        {
            "name": "HOMESTEAD_CASSANDRA_COMM_ERROR",
            "index": 1501,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "levels": [
                {
                  "severity": "CLEARED",
                  "details": "Communication between the local Homestead process and the Cassandra service has been restored.",
                  "description": "Homestead: Cassandra communication error cleared.",
                  "cause": "Communication between the local Homestead process and the Cassandra service has been restored.",
                  "effect": "The local Homestead process can succesfully contact the Cassandra service.",
                  "action": "No action."
                },
                {
                  "severity": "CRITICAL",
                  "details": "The local Homestead process is unable to contact the Cassandra service.",
                  "description": "Homestead: Cassandra communication error.",
                  "cause": "The local Homestead is unable to contact any Cassandra processes. The likely cause depends on whether this is effecting all Homestead instances or just a subset. If the issue impacts just a subset of Homestead instances then it is likely to be due to a partial network outage or configuration issues on those nodes. If it impacts all Homestead instances then it is likely to be due to a misconfiguration of the Cassandra hostname in shared configuration, misconfiguration of the Cassandra cluster DNS record, a significant network outage, or because all Cassandra instances are currently failed.",
                  "effect": "The effect of this is equivalent to the local Homestead process having failed. If only a small percentage of Homestead processes are failed simultaneously then in a typical deployment there will be no significant impact. However multiple simultaneous failures will result in an increasingly significant reduction in HSS communication capacity and will eventually result in service impacts. If all Homestead processes are failed then all registrations and all new calls involving local subscribers will fail.",
                  "action": "Investigate the issue that is preventing the local Homestead process from contacting Cassandra. The Homestead process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "name": "HOMESTEAD_HSS_COMM_ERROR",
            "index": 1502,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "levels": [
                {
                  "severity": "CLEARED",
                  "details": "Homestead communication to at least one HSS has been restored.",
                  "description": "Homestead: HSS communication error cleared.",
                  "cause": "Homestead communication to at least one HSS has been restored. The previously issued alarm has been cleared.",
                  "effect": "The local Homestead process can succesfully contact the HSS again.",
                  "action": "No action."
                },
                {
                  "severity": "CRITICAL",
                  "details": "The local Homestead process is unable to contact any HSSs.",
                  "description": "Homestead: HSS communication error.",
                  "cause": "The local Homestead process is unable to contact any HSS instances. The likely cause depends on whether this is effecting all Homestead instances or just a subset. If the issue impacts just a subset of Homestead instances then it is likely to be due to a partial network outage or configuration issues on those nodes. If it impacts all Homestead instances then it is likely to be due to a misconfiguration of the HSS hostname in shared configuration, misconfiguration of DNS, a significant network outage, or because all HSS instances are currently failed.",
                  "effect": "This effect of this is equivalent to the local Homestead process having failed. If only a small percentage of Homestead processes are failed simultaneously then in a typical deployment there will be no significant impact. However multiple simultaneous failures will result in an increasingly significant reduction in HSS communication capacity and will eventually result in service impacts. If all Homestead processes are failed then all registrations and all new calls involving local subscribers will fail.",
                  "action": "Investigate the issue that is preventing the local Homestead process from contacting the HSS. The Homestead process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1503,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "HOMESTEAD_ASTAIRE_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Communication between the local Homestead process and the Astaire service has been restored.",
                    "description": "Homestead: Astaire communication error cleared.",
                    "cause": "Communication between the local Homestead process and the Astaire service has been restored.",
                    "effect": "The local Homestead process can successfully contact the Astaire service.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "The local Homestead process is unable to contact the Astaire service.",
                    "description": "Homestead: Astaire communication error.",
                    "cause": "The local Homestead process is unable to contact any Astaire processes. The likely cause depends on whether this is affecting all Homestead instances or just a subset. If the issue impacts just a subset of Homestead instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Homestead instances then it is likely to be due to a misconfiguration of the Homestead registration store in shared configuration, misconfiguration of the Astaire cluster DNS record, a significant network outage, or because all Astaire instances are currently failed.",
                    "effect": "This is broadly equivalent to the local Homestead having failed. If only a small percentage of Homestead processes are failed simultaneously then in a typical deployment there will be no significant impact. However multiple simultaneous failures will result in an increasingly significant reduction in SIP processing capacity and will eventually result in service impacts. If all Homestead instances are failed then all future SIP registrations and call attemps will fail until such time as one or more Homestead instances recover.",
                    "action": "Investigate the issue that is preventing the local Homestead process from contacting the Astaire service. The Homestead process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1504,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "HOMESTEAD_REMOTE_ASTAIRE_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The local Homestead process is able to successfully communicate with one or more Astaire processes in remote sites.",
                    "description": "Homestead: Remote Astaire communication error cleared.",
                    "cause": "The local Homestead process is able to successfully communicate with one or more remote Astaire instances.",
                    "effect": "The local Homestead process can successfully contact the remote Astaire service.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "The local Homestead process is unable to contact any Astaire instances in remote sites.",
                    "description": "Homestead: Remote Astaire communication error.",
                    "cause": "The local Homestead process is unable to contact any Astaire processes in remote sites. The likely cause depends on whether this is affecting all Homestead instances or just a subset. If the issue impacts just a subset of Homestead instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Homestead instances then it is likely to be due to a misconfiguration of the remote Homestead registration store in shared configuration, misconfiguration of the Astaire cluster DNS record, a significant network outage, or because all remote Astaire instances are currently failed.",
                    "effect": "The deployment is no longer geographically redundant because the S-CSCF cannot synchronize registration data to remote sites. If subscribers switch to other geographic sites they may have to re-register before becoming operational.",
                    "action": "Investigate the issue that is preventing the local Homestead process from contacting Astaire processes in remote sites. The Homestead process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "name": "HOMESTEAD_HSS_REALM_PEER_ERROR",
            "index": 1505,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "levels": [
                {
                  "severity": "CLEARED",
                  "details": "Either Homestead communication to previously unreachable HSS instances has been restored or the number of reachable diameter peers is greater than or equal to the number expected.",
                  "description": "Homestead: HSS instance communication error cleared.",
                  "cause": "Homestead communication to previously unreachable HSS instances has been restored. The previously issued alarm has been cleared.",
                  "effect": "The local Homestead process can successfully contact either all discovered HSS instances or the expected number of HSS instances (two, unless overridden through configuration).",
                  "action": "No action."
                },
                {
                  "severity": "MINOR",
                  "details": "The local Homestead process is unable to contact some HSS instances. The the number of reachable HSS instances is strictly less than the number expected. See the ENT logs for details.",
                  "description": "Homestead: HSS instance communication error.",
                  "cause": "The local Homestead process is unable to contact some HSS instances and the number of reachable HSS peers is strictly less than the number expected (two, unless overridden through configuration). The likely cause depends on whether this is effecting all Homestead instances or just a subset. If the issue impacts just a subset of Homestead instances then it is likely to be due to a partial network outage or configuration issues on those nodes. If it impacts all Homestead instances then it is likely to be due to a misconfiguration of the HSS hostname in shared configuration, misconfiguration of DNS, a significant network outage, or because all HSS instances are currently failed.",
                  "effect": "If at least one HSS instance could be contacted, there is no impact on service, but resilience of the HSS connectivity from this Homestead is reduced.  If no HSS instances could be contacted, a separate CRITICAL ‘Homestead: HSS communication error’ will also be raised.  Refer to that alarm for the details of the effect.",
                  "action": "Investigate the issue that is preventing the local Homestead process from contacting the HSS. The Homestead process will periodically attempt to reconnect and this alarm will clear once connectivity to this instance has been restored or the number of reachable HSS peers is at least the expected number of HSS instances (two, unless overriden through configuration). If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        }
    ]
}
